Repository: mmatyas/DeltaPatcher
Catalog: languages/*/deltapatcher.po
Languages: hu

source: Backup original file
hu: Biztonsági másolat az eredeti fájlról

source: Checksum validation
hu: Ellenőrzőösszeg validálása

source: xdelta patches (*.xdelta)|*.xdelta
hu: xdelta patch (*.xdelta)|*.xdelta

source: Fill all the textboxes first!
hu: Előbb töltsd ki a mezőket!

source: Warning
hu: Vigyázz!

source: Applying patch, please wait... (don't panic!)
hu: Patch alkalmazása folyamatban... (türelem!)

source: Patch file "%s" selected
hu: Patch fájl "%s" kiválasztva

source: , description found: %s
hu: , leírás: %s

source: Original file "%s" selected.
hu: Eredeti fájl "%s" kiválasztva.

source: Could not create the worker thread!
hu: Nem sikerült szálat létrehozni!

source: Could not RUN the worker thread!
hu: Nem sikerült szálat elindítani!

source: An error has occurred! See log for more information.
hu: Hiba történt! A futásnaplóban találod a részleteket.

source: Patch successfully applied!
hu: Patch sikeresen alkalmazva!

source: Notice
hu: Megjegyzés

source: Main compression level
hu: Elsődleges tömörítés szintje

source: Secondary compression
hu: Másodlagos tömörítés

source: Src Window Size
hu: Forrás blokkméret

source: Add Checksum to patch
hu: Ellenőrzőösszeg mellékelése

source: Creating patch, please wait... (don't panic!)
hu: Patchkészítés folyamatban... (türelem!)

source: Patch file "%s" selected.
hu: Patch fájl "%s" kiválasztva.

source: Modified file "%s" selected.
hu: Módosított fájl "%s" kiválasztva.

source: Patch successfully created!
hu: A patch sikeresen elkészült!

source: Show log >>
hu: Napló megjelenítése >>

source: << Hide log
hu: << Napló elrejtése

source: [%s] An error has occurred: %s
hu: [%s] Hiba történt: %s

source: Shows information about this program.
hu: Információk a programról.

source: Switches between patch creation and patch application modes.
hu: Átváltás a patchkészítő és -alkalmazó mód között.

source: Hides/Shows the log window.
hu: Folyamatnapló elrejtése/megjelenítése.

source: Log:
hu: Folyamatnapló:

source: Original file:
hu: Eredeti fájl:

source: Choose the file to patched.
hu: Válaszd ki a fájlt, amire szeretnéd alkalmazni a patchet.

source: Choose the patch to be applied to the selected file.
hu: Válaszd ki a patchet, amit szeretnél alkalmazni a fenti fájlra.

source: Apply patch
hu: Patch alkalmazása

source: Applies the selected patch to the given file.
hu: A megadott patch alkalmazása a választott fájlra.

source: Changes settings for patch application.
hu: Patchelés beállítások módosítása.

source: Choose the original (untouched) file.
hu: Válaszd ki az eredeti, módosítások nélküli fájlt.

source: Modified file:
hu: Módosított fájl:

source: Choose the modified file.
hu: Válaszd ki a módosított fájlt.

source: Choose where to save the patch containing the differences between the original and the modified file.
hu: Válaszd ki, hova szeretnéd menteni a patch fájlt, ami az eredeti és a módosított közötti eltérést fogja tárolni.

source: Description (optional):
hu: Leírás (elhagyható):

source: Create patch
hu: Patchkészítés

source: Creates a patch containing the differences between the original and the modified file.
hu: Létrehoz egy patch fájlt, ami az eredeti és a módosított közötti eltérést tárolja.

source: Changes settings for patch creation.
hu: Létrehozási beállítások módosítása.

source: About
hu: Névjegy

source: License
hu: Licenc

source: OK
hu: Rendben
